Repository: gAtrium/pamuk_flutter
Catalog: lib/l10n/app_*.arb
Languages: tr

# appSubtitle
source: Android Adware Uninstallation Tool
tr: Android Adware Kaldırma Aracı

source: Connect to Device
tr: Cihaza Bağlan

source: Disconnect
tr: Bağlantıyı Kes

source: Connected
tr: Bağlandı

source: Connecting...
tr: Bağlanıyor...

source: Disconnected
tr: Bağlantı Kesildi

source: Error
tr: Hata

source: Catalogue Mode
tr: Katalog Modu

source: Hunter Mode
tr: Avcı Modu

# appListMode
source: App List
tr: Uygulama Listesi

source: Search apps...
tr: Uygulama ara...

source: Refresh Apps
tr: Uygulamaları Yenile

source: Uninstall
tr: Kaldır

source: Backup
tr: Yedekle

source: Installed Apps
tr: Yüklü Uygulamalar

source: Adware Apps
tr: Adware Uygulamaları

source: Current App
tr: Mevcut Uygulama

source: Version
tr: Sürüm

source: Install Date
tr: Yükleme Tarihi

source: Update Date
tr: Güncelleme Tarihi

source: Package Name
tr: Paket Adı

source: ADB not found
tr: ADB bulunamadı

# adbNotFoundDescription
source: Please install Android SDK platform tools and add ADB to your PATH
tr: Lütfen Android SDK platform araçlarını yükleyin ve ADB'yi PATH'e ekleyin

source: No device connected
tr: Bağlı cihaz yok

# noDeviceConnectedDescription
source: Please connect an Android device with USB debugging enabled
tr: Lütfen USB hata ayıklama etkin bir Android cihaz bağlayın

source: Device unauthorized
tr: Cihaz yetkisiz

# deviceUnauthorizedDescription
source: Please allow USB debugging on your Android device
tr: Lütfen Android cihazınızda USB hata ayıklamasına izin verin

source: Loading apps...
tr: Uygulamalar yükleniyor...

source: No apps found
tr: Uygulama bulunamadı

# uninstallSuccess
source: App uninstalled successfully
tr: Uygulama başarıyla kaldırıldı

# uninstallError
source: Failed to uninstall app
tr: Uygulama kaldırılamadı

# backupSuccess
source: App backed up and uninstalled successfully
tr: Uygulama başarıyla yedeklendi ve kaldırıldı

# backupError
source: Failed to backup and uninstall app
tr: Uygulama yedeklenemedi ve kaldırılamadı

source: Select backup location
tr: Yedekleme konumunu seçin

# hunterModeDescription
source: Hunter mode monitors the currently running app and checks if it's adware
tr: Avcı modu şu anda çalışan uygulamayı izler ve adware olup olmadığını kontrol eder

# catalogueModeDescription
source: Catalogue mode shows all known adware apps from the catalogue
tr: Katalog modu katalogdaki tüm bilinen adware uygulamalarını gösterir

# appListModeDescription
source: App list mode shows all installed apps on the device
tr: Uygulama listesi modu cihazdaki tüm yüklü uygulamaları gösterir

source: Settings
tr: Ayarlar

source: Language
tr: Dil

source: English
tr: İngilizce

source: Turkish
tr: Türkçe

source: About
tr: Hakkında

# aboutDescription
source: Pamuk Desktop is a Flutter application for detecting and removing Android adware apps.
tr: Pamuk Desktop, Android adware uygulamalarını tespit etmek ve kaldırmak için geliştirilmiş bir Flutter uygulamasıdır.

source: Device
tr: Cihaz

source: Restart ADB Server
tr: ADB Sunucusunu Yeniden Başlat

source: Troubleshooting
tr: Sorun Giderme

# troubleshootingTitle
source: Connection Troubleshooting
tr: Bağlantı Sorun Giderme

# troubleshootingDescription
source: If you're having trouble connecting to your Android device, please check:
tr: Android cihazınıza bağlanmakta sorun yaşıyorsanız, lütfen şunları kontrol edin:

# adbInstallation
source: 1. ADB Installation:
tr: 1. ADB Kurulumu:

# installAndroidSDK
source: • Install Android SDK platform tools
tr: • Android SDK platform araçlarını yükleyin

# addAdbToPath
source: • Add ADB to your system PATH
tr: • ADB'yi sistem PATH'ine ekleyin

# testAdbDevices
source: • Test with: adb devices
tr: • Şu komutla test edin: adb devices

# deviceSettings
source: 2. Device Settings:
tr: 2. Cihaz Ayarları:

source: • Enable Developer Options
tr: • Geliştirici Seçeneklerini etkinleştirin

source: • Enable USB Debugging
tr: • USB Hata Ayıklamasını etkinleştirin

# setUsbMode
source: • Set USB mode to File Transfer (MTP)
tr: • USB modunu Dosya Aktarımı (MTP) olarak ayarlayın

# connectionTroubleshooting
source: 3. Connection:
tr: 3. Bağlantı:

# useQualityUSBCable
source: • Use a good quality USB cable
tr: • Kaliteli bir USB kablosu kullanın

# tryDifferentPorts
source: • Try different USB ports
tr: • Farklı USB portlarını deneyin

# acceptUsbDialog
source: • Accept USB debugging dialog on device
tr: • Cihazdaki USB hata ayıklama iletişim kutusunu kabul edin

# permissions
source: 4. Permissions:
tr: 4. İzinler:

# runAsAdmin
source: • Run this app as administrator (if needed)
tr: • Bu uygulamayı yönetici olarak çalıştırın (gerekirse)

# checkUsbAuthorization
source: • Check USB debugging authorization
tr: • USB hata ayıklama yetkilendirmesini kontrol edin

source: Close
tr: Kapat

source: Mode
tr: Mod

source: Hunter Mode Active
tr: Avcı Modu Aktif

# monitoringCurrentApp
source: Monitoring the current foreground app on your device.
tr: Cihazınızdaki mevcut ön plan uygulaması izleniyor.

source: How it works:
tr: Nasıl çalışır:

# step1
source: 1. Open any app on your Android device
tr: 1. Android cihazınızda herhangi bir uygulamayı açın

# step2
source: 2. The app will be detected and shown below
tr: 2. Uygulama tespit edilecek ve aşağıda gösterilecek

# step3
source: 3. You can choose to uninstall suspicious apps immediately
tr: 3. Şüpheli uygulamaları hemen kaldırmayı seçebilirsiniz

# step4
source: 4. Uninstalled apps are automatically added to the catalogue
tr: 4. Kaldırılan uygulamalar otomatik olarak kataloğa eklenir

# waitingForApp
source: Waiting for app to be detected...
tr: Uygulama tespiti bekleniyor...

# openAnyApp
source: Open any app on your Android device
tr: Android cihazınızda herhangi bir uygulamayı açın

source: Uninstall App
tr: Uygulamayı Kaldır

# confirmUninstall
source: Are you sure you want to uninstall "{appName}"?
tr: "{appName}" uygulamasını kaldırmak istediğinizden emin misiniz?

source: Cancel
tr: İptal

source: Uninstall Now
tr: Şimdi Kaldır

# backupAndUninstall
source: Backup & Uninstall
tr: Yedekle ve Kaldır

# scanningAdware
source: Scanning for adware packages...
tr: Adware paketleri taranıyor...

# deviceClean
source: Your device looks clean. No known adware packages were detected.
tr: Cihazınız temiz görünüyor. Bilinen hiçbir adware paketi tespit edilmedi.

source: Switch to Hunter Mode
tr: Avcı Moduna Geç

source: Uninstall All
tr: Tümünü Kaldır

source: Uninstall All Adware
tr: Tüm Adware'leri Kaldır

# uninstalledPackages
source: Uninstalled {count} packages
tr: {count} paket kaldırıldı

# loadingAppsMessage
source: Loading installed apps...
tr: Yüklü uygulamalar yükleniyor...

# appsCount
source: {count} apps
tr: {count} uygulama

# noAppsFoundSearch
source: No apps found
tr: Uygulama bulunamadı

# adjustSearchTerms
source: Try adjusting your search terms
tr: Arama terimlerinizi ayarlamayı deneyin

# tryRefreshing
source: Try refreshing the app list
tr: Uygulama listesini yenilemeyi deneyin

source: Refresh
tr: Yenile

source: Details
tr: Detaylar

source: App Details
tr: Uygulama Detayları

# confirmUninstallAll
source: Are you sure you want to uninstall all {count} adware apps?
tr: Tüm {count} adware uygulamasını kaldırmak istediğinizden emin misiniz?

source: No adware found!
tr: Adware bulunamadı!

source: Adware Detected!
tr: Adware Tespit Edildi!

# suspiciousPackagesFound
source: {count} suspicious packages found
tr: {count} şüpheli paket bulundu

source: This action cannot be undone.
tr: Bu işlem geri alınamaz.

# successfullyUninstalled
source: Successfully uninstalled {appName}
tr: {appName} başarıyla kaldırıldı

# failedToUninstall
source: Failed to uninstall {appName}
tr: {appName} kaldırılamadı

# backupApkMessage
source: This will backup the APK file for "{appName}" and then uninstall it. The APK will be saved to the apk_backups folder.
tr: Bu, "{appName}" için APK dosyasını yedekleyecek ve ardından kaldıracaktır. APK, apk_backups klasörüne kaydedilecektir.

# successfullyBackedUpAndUninstalled
source: Successfully backed up and uninstalled {appName}
tr: {appName} başarıyla yedeklendi ve kaldırıldı

# failedToBackupAndUninstall
source: Failed to backup and uninstall {appName}
tr: {appName} yedeklenemedi ve kaldırılamadı

source: Unknown
tr: Bilinmeyen

source: Package
tr: Paket

source: Installed
tr: Yüklendi

source: Updated
tr: Güncellendi

source: SUSPICIOUS
tr: ŞÜPHELİ

# knownSuspiciousApp
source: Known {category} app!
tr: Bilinen {category} uygulama!

source: Contribute to Repository
tr: Depoya Katkıda Bulun

# packageAddedToCatalogue
source: Package {packageName} has been added to the catalogue under '{category}' category.
tr: {packageName} paketi kataloga '{category}' kategorisi altında eklendi.

# considerContributing
source: Please consider opening an issue at github.com/gAtrium/pamuk to help include this package in the official repository.
tr: Bu paketin resmi depoya dahil edilmesine yardımcı olmak için lütfen github.com/gAtrium/pamuk adresinde bir sorun açmayı düşünün.

source: Open GitHub
tr: GitHub'ı Aç

source: Not Now
tr: Şimdi Değil
